
/**
seriesData数据格式说明:
title: "图表标题",
subtext: "可为空",
legend_data: 数据集名称数组,['a','b']
map_data: 展现数据, [{name:城市名称,value:(经度,维度,数值)} ]
**/
function scatterMap(myChart, seriesData) {
    //alert(seriesData.map_data);

    // 处理series数据
        var series = [];

        for (var i = 0; i < seriesData.map_data.length; i++) {
            series.push( {
                name: seriesData.legend_data[i],
                type: 'scatter',
                coordinateSystem: 'geo',
                data: seriesData.map_data[i],
                symbolSize: 8,
                label: {
                                normal: {
                                    formatter: '{b}',
                                    position: 'right',
                                    show: false
                                },
                                emphasis: {
                                    show: true
                                }
                            },
                            itemStyle: {
                                normal: {
                                    color: '#ff8000'
                                }
                            }
            });
        }

    var option =  {
        backgroundColor: '#404a59',
        title: {
            text: seriesData.title,
            subtext: seriesData.subtext,
            sublink: '',
            left: 'center',
            textStyle: {
                color: '#fff'
            }
        },
        tooltip : {
            trigger: 'item'
        },
        legend: {
            orient: 'vertical',
            y: 'bottom',
            x:'right',
            data: seriesData.legend_data,
            textStyle: {
                color: '#fff'
            }
        },
        dataRange: {
            min: 0,
            max: 100000,
            calculable: true,
            color: ['#ff8000','#eac736','#50a3ba'],
            textStyle: {
                color: '#fff'
            }
        },
        geo: {
            map: 'china',
            label: {

                emphasis: {
                    show: false
                }
            },
            roam: true,
            itemStyle: {
                normal: {
                    areaColor: '#323c48',
                    borderColor: '#111'
                },
                emphasis: {
                    areaColor: '#2a333d'
                }
            }
        },
        series: series
    };

    myChart.setOption(option);



}


function scatterMap2(myChart) {

    var data11 = [
    {name: '南京市', value: 873436}
    ];
    var data12 = [
    {name: '杭州市', value: 342635},
    {name: '汉中市', value: 146728},
    {name: '宁波市', value: 145100},
    {name: '南宁市', value: 127549},
    {name: '淮安市', value: 113569},
    {name: '广州市', value: 100727},
    {name: '台州市', value: 95527}
    ];
    var data13 = [
    {name: '泰州市', value: 94999},
    {name: '厦门市', value: 92576},
    {name: '绍兴市', value: 86894},
    {name: '西安市', value: 82564},
    {name: '福州市', value: 77490},
    {name: '云浮市', value: 62243},
    {name: '上海市', value: 59606},
    {name: '三明市', value: 49159},
    {name: '深圳市', value: 46916},
    {name: '保定市', value: 44419},
    {name: '临沂市', value: 43693},
    {name: '舟山市', value: 42370},
    {name: '连云港市', value: 42039},
    {name: '泉州市', value: 38332},
    {name: '衢州市', value: 37334},
    {name: '宿迁市', value: 36982},
    {name: '扬州市', value: 35265},
    {name: '宣城市', value: 34582},
    {name: '张家界市', value: 31358},
    {name: '金华市', value: 30606},
    {name: '丽水市', value: 29919},
    {name: '武汉市', value: 27869},
    {name: '长沙市', value: 27510},
    {name: '赣州市', value: 26977},
    {name: '建德市', value: 26249},
    {name: '龙岩市', value: 25440},
    {name: '嘉兴市', value: 24859},
    {name: '温州市', value: 24619},
    {name: '湛江市', value: 23576},
    {name: '天津市', value: 23296},
    {name: '安康市', value: 22540},
    {name: '六安市', value: 20683},
    {name: '桐乡市', value: 20412},
    {name: '南平市', value: 19776},
    {name: '宁德市', value: 19665},
    {name: '海口市', value: 19261},
    {name: '芜湖市', value: 18065},
    {name: '日照市', value: 17508},
    {name: '北海市', value: 16956},
    {name: '衡水市', value: 16678},
    {name: '大庆市', value: 15907},
    {name: '衡阳市', value: 15731},
    {name: '湖州市', value: 15656},
    {name: '襄阳市', value: 15352},
    {name: '常德市', value: 15002},
    {name: '邵阳市', value: 14717},
    {name: '淮北市', value: 14592},
    {name: '莆田市', value: 13912},
    {name: '茂名市', value: 13858},
    {name: '济南市', value: 13609},
    {name: '阜阳市', value: 13289},
    {name: '柳州市', value: 13144},
    {name: '江门市', value: 12982},
    {name: '临海市', value: 12654},
    {name: '周口市', value: 12025},
    {name: '黄冈市', value: 11854},
    {name: '蚌埠市', value: 11794},
    {name: '荆州市', value: 11743},
    {name: '宜昌市', value: 11644},
    {name: '沧州市', value: 11592},
    {name: '娄底市', value: 11200},
    {name: '烟台市', value: 10303},
    {name: '潍坊市', value: 9693},
    {name: '黄山市', value: 9687},
    {name: '遂宁市', value: 9606},
    {name: '湘潭市', value: 9539},
    {name: '宿州市', value: 9422},
    {name: '信阳市', value: 9361},
    {name: '阳江市', value: 9227},
    {name: '北京市', value: 8296},
    {name: '株洲市', value: 8261},
    {name: '湘西土家族苗族自治州', value: 8040},
    {name: '惠州市', value: 8005},
    {name: '珠海市', value: 7691},
    {name: '南阳市', value: 7678},
    {name: '百色市', value: 7576},
    {name: '咸宁市', value: 7559},
    {name: '东莞市', value: 7380},
    {name: '渭南市', value: 7267},
    {name: '永州市', value: 7222},
    {name: '桂林市', value: 7059},
    {name: '重庆市', value: 7048},
    {name: '泰安市', value: 6908},
    {name: '淄博市', value: 6762},
    {name: '绵阳市', value: 6693},
    {name: '洛阳市', value: 6679},
    {name: '崇左市', value: 6581},
    {name: '绍兴县', value: 6558},
    {name: '银川市', value: 6411},
    {name: '益阳市', value: 6334},
    {name: '三亚市', value: 6309},
    {name: '秦皇岛市', value: 6226},
    {name: '漳州市', value: 6206},
    {name: '郴州市', value: 5807},
    {name: '开封市', value: 5644},
    {name: '巢湖市', value: 5451},
    {name: '贺州市', value: 5415},
    {name: '西宁市', value: 5292},
    {name: '临汾市', value: 4979},
    {name: '庆阳市', value: 4922},
    {name: '佛山市', value: 4651},
    {name: '怀化市', value: 4597},
    {name: '滨州市', value: 4571},
    {name: '玉林市', value: 4112},
    {name: '新乡市', value: 3965},
    {name: '肇庆市', value: 3918},
    {name: '威海市', value: 3785},
    {name: '来宾市', value: 3596},
    {name: '随州市', value: 3556},
    {name: '聊城市', value: 3555},
    {name: '许昌市', value: 3555},
    {name: '天水市', value: 3406},
    {name: '孝感市', value: 3326},
    {name: '平凉市', value: 3237},
    {name: '中山市', value: 3159},
    {name: '清远市', value: 3038},
    {name: '石家庄市', value: 2866},
    {name: '邯郸市', value: 2804},
    {name: '五指山市', value: 2745},
    {name: '盐城市', value: 2587},
    {name: '宝鸡市', value: 2339},
    {name: '宜春市', value: 2336},
    {name: '儋州市', value: 2330},
    {name: '漯河市', value: 2149},
    {name: '吕梁市', value: 2115},
    {name: '邢台市', value: 2054},
    {name: '德州市', value: 2053},
    {name: '琼海市', value: 1805},
    {name: '淮南市', value: 1741},
    {name: '玉环县', value: 1714},
    {name: '贵港市', value: 1696},
    {name: '屯昌县', value: 1691},
    {name: '陇南市', value: 1629},
    {name: '保亭县', value: 1579},
    {name: '梅州市', value: 1471},
    {name: '乐东县', value: 1447},
    {name: '文昌市', value: 1366},
    {name: '防城港市', value: 1363},
    {name: '朔州市', value: 1323},
    {name: '中卫市', value: 1306},
    {name: '临高县', value: 1167},
    {name: '商洛市', value: 1140},
    {name: '晋中市', value: 1126},
    {name: '延安市', value: 984},
    {name: '固原市', value: 937},
    {name: '琼中县', value: 883},
    {name: '昌江县', value: 776},
    {name: '万宁市', value: 758},
    {name: '定安县', value: 753},
    {name: '岳阳市', value: 745},
    {name: '鄂尔多斯市', value: 736},
    {name: '东方市', value: 697},
    {name: '恩施州', value: 676},
    {name: '武威市', value: 653},
    {name: '吴忠市', value: 628},
    {name: '苏州市', value: 595},
    {name: '鹤岗市', value: 587},
    {name: '陵水县', value: 536},
    {name: '运城市', value: 509},
    {name: '巴彦淖尔市', value: 505},
    {name: '汕头市', value: 466},
    {name: '韶关市', value: 450},
    {name: '南通市', value: 345},
    {name: '澄迈县', value: 340},
    {name: '昆明市', value: 299},
    {name: '白沙县', value: 287},
    {name: '濮阳市', value: 256},
    {name: '咸阳市', value: 254},
    {name: '张家口市', value: 248},
    {name: '石嘴山市', value: 203},
    {name: '赤峰市', value: 194},
    {name: '忻州市', value: 181},
    {name: '丽江市', value: 152},
    {name: '揭阳市', value: 150},
    {name: '徐州市', value: 148},
    {name: '香港', value: 117},
    {name: '安仁县', value: 105},
    {name: '海西州', value: 103},
    {name: '武陵区', value: 101},
    {name: '乌海市', value: 91},
    {name: '铜川市', value: 89},
    {name: '贵阳市', value: 82},
    {name: '安阳市', value: 77},
    {name: '鹤壁市', value: 74},
    {name: '定西市', value: 61},
    {name: '商丘市', value: 48},
    {name: '洪江市', value: 46},
    {name: '阳泉市', value: 45},
    {name: '呼和浩特市', value: 36},
    {name: '杭锦后旗', value: 23},
    {name: '昭通市', value: 19},
    {name: '岐山县', value: 16},
    {name: '黄石市', value: 15},
    {name: '海南州', value: 11},
    {name: '兴山县', value: 10},
    {name: '文山州', value: 9},
    {name: '文县', value: 8},
    {name: '巴林右旗', value: 4},
    {name: '云安县', value: 4},
    {name: '佳木斯市', value: 3},
    {name: '克什克腾旗', value: 3},
    {name: '驻马店市', value: 3},
    {name: '六盘水市', value: 2}
    ];

    var data21 = [
    {name: '南京市', value: 1047937}
    ];
    var data22 = [
    {name: '杭州市', value: 735308},
    {name: '泰州市', value: 214517},
    {name: '宁波市', value: 202555},
    {name: '淮安市', value: 155806},
    {name: '福州市', value: 153226},
    {name: '汉中市', value: 140154},
    {name: '盐城市', value: 138019}
    ];
    var data23 = [
    {name: '厦门市', value: 128040},
    {name: '台州市', value: 112379},
    {name: '上海市', value: 109116},
    {name: '广州市', value: 98645},
    {name: '南宁市', value: 96930},
    {name: '绍兴市', value: 81471},
    {name: '深圳市', value: 79717},
    {name: '保定市', value: 72202},
    {name: '宿迁市', value: 66346},
    {name: '舟山市', value: 66122},
    {name: '泉州市', value: 64406},
    {name: '丽水市', value: 62162},
    {name: '三明市', value: 57562},
    {name: '赣州市', value: 55012},
    {name: '宣城市', value: 46967},
    {name: '扬州市', value: 46517},
    {name: '衢州市', value: 41506},
    {name: '桐乡市', value: 41073},
    {name: '天津市', value: 38703},
    {name: '西安市', value: 36532},
    {name: '龙岩市', value: 36364},
    {name: '武汉市', value: 33579},
    {name: '嘉兴市', value: 32926},
    {name: '宁德市', value: 30694},
    {name: '临沂市', value: 30426},
    {name: '莆田市', value: 27958},
    {name: '张家界市', value: 25701},
    {name: '金华市', value: 25564},
    {name: '昆明市', value: 25048},
    {name: '丽江市', value: 24793},
    {name: '连云港市', value: 24545},
    {name: '湖州市', value: 22693},
    {name: '海口市', value: 21611},
    {name: '临海市', value: 20347},
    {name: '日照市', value: 19613},
    {name: '蚌埠市', value: 19348},
    {name: '衡水市', value: 19279},
    {name: '衡阳市', value: 18766},
    {name: '芜湖市', value: 18329},
    {name: '温州市', value: 16895},
    {name: '云浮市', value: 16773},
    {name: '遂宁市', value: 15623},
    {name: '周口市', value: 15351},
    {name: '烟台市', value: 15200},
    {name: '淮北市', value: 14388},
    {name: '北海市', value: 14055},
    {name: '沧州市', value: 12800},
    {name: '北京市', value: 12489},
    {name: '柳州市', value: 12297},
    {name: '重庆市', value: 12246},
    {name: '信阳市', value: 11662},
    {name: '南阳市', value: 11594},
    {name: '潍坊市', value: 11584},
    {name: '秦皇岛市', value: 11461},
    {name: '宜昌市', value: 11347},
    {name: '襄阳市', value: 10894},
    {name: '南平市', value: 10735},
    {name: '百色市', value: 10436},
    {name: '湛江市', value: 9961},
    {name: '茂名市', value: 9486},
    {name: '咸宁市', value: 9258},
    {name: '漳州市', value: 9217},
    {name: '绵阳市', value: 9139},
    {name: '江门市', value: 9084},
    {name: '西宁市', value: 8724},
    {name: '荆州市', value: 8611},
    {name: '巢湖市', value: 8282},
    {name: '洛阳市', value: 8253},
    {name: '常德市', value: 8043},
    {name: '黄冈市', value: 7833},
    {name: '娄底市', value: 7776},
    {name: '珠海市', value: 7765},
    {name: '益阳市', value: 7548},
    {name: '淄博市', value: 7498},
    {name: '泰安市', value: 7054},
    {name: '惠州市', value: 6585},
    {name: '黄山市', value: 6346},
    {name: '三亚市', value: 6323},
    {name: '银川市', value: 5899},
    {name: '石家庄市', value: 5495},
    {name: '永州市', value: 5268},
    {name: '六安市', value: 5093},
    {name: '阳江市', value: 4994},
    {name: '湘潭市', value: 4770},
    {name: '宿州市', value: 4464},
    {name: '阜阳市', value: 4371},
    {name: '渭南市', value: 4236},
    {name: '新乡市', value: 4004},
    {name: '宜春市', value: 3932},
    {name: '庆阳市', value: 3882},
    {name: '建德市', value: 3757},
    {name: '邢台市', value: 3460},
    {name: '东莞市', value: 3450},
    {name: '中山市', value: 3436},
    {name: '许昌市', value: 3137},
    {name: '佛山市', value: 2959},
    {name: '株洲市', value: 2560},
    {name: '湘西土家族苗族自治州', value: 2490},
    {name: '郴州市', value: 2370},
    {name: '来宾市', value: 2329},
    {name: '儋州市', value: 2245},
    {name: '五指山市', value: 2244},
    {name: '肇庆市', value: 2237},
    {name: '临汾市', value: 2194},
    {name: '崇左市', value: 1968},
    {name: '清远市', value: 1924},
    {name: '淮南市', value: 1873},
    {name: '邵阳市', value: 1833},
    {name: '邯郸市', value: 1701},
    {name: '东方市', value: 1678},
    {name: '延安市', value: 1641},
    {name: '琼海市', value: 1514},
    {name: '屯昌县', value: 1465},
    {name: '济南市', value: 1459},
    {name: '绍兴县', value: 1261},
    {name: '玉环县', value: 1219},
    {name: '乐东县', value: 1174},
    {name: '固原市', value: 1153},
    {name: '中卫市', value: 1080},
    {name: '临高县', value: 1040},
    {name: '琼中县', value: 1012},
    {name: '保亭县', value: 969},
    {name: '文昌市', value: 967},
    {name: '玉林市', value: 966},
    {name: '天水市', value: 912},
    {name: '梅州市', value: 893},
    {name: '保山市', value: 892},
    {name: '韶关市', value: 769},
    {name: '威海市', value: 729},
    {name: '昌江县', value: 709},
    {name: '吕梁市', value: 693},
    {name: '滨州市', value: 661},
    {name: '恩施州', value: 615},
    {name: '鄂尔多斯市', value: 594},
    {name: '张家口市', value: 557},
    {name: '贵港市', value: 554},
    {name: '贺州市', value: 528},
    {name: '陇南市', value: 528},
    {name: '汕头市', value: 523},
    {name: '平凉市', value: 504},
    {name: '昭通市', value: 438},
    {name: '吴忠市', value: 406},
    {name: '巴彦淖尔市', value: 390},
    {name: '大庆市', value: 361},
    {name: '万宁市', value: 341},
    {name: '陵水县', value: 331},
    {name: '香港', value: 305},
    {name: '定安县', value: 302},
    {name: '六盘水市', value: 270},
    {name: '乌海市', value: 266},
    {name: '呼和浩特市', value: 265},
    {name: '亳州市', value: 261},
    {name: '澄迈县', value: 251},
    {name: '文山州', value: 243},
    {name: '开封市', value: 197},
    {name: '晋中市', value: 159},
    {name: '安康市', value: 156},
    {name: '白沙县', value: 154},
    {name: '聊城市', value: 142},
    {name: '海西州', value: 127},
    {name: '石嘴山市', value: 96},
    {name: '咸阳市', value: 91},
    {name: '德州市', value: 88},
    {name: '岳阳市', value: 88},
    {name: '随州市', value: 78},
    {name: '铜川市', value: 59},
    {name: '泸州市', value: 51},
    {name: '曲靖市', value: 44},
    {name: '武陵区', value: 38},
    {name: '鹤岗市', value: 31},
    {name: '杭锦后旗', value: 15},
    {name: '孝感市', value: 15},
    {name: '黄石市', value: 13},
    {name: '阳泉市', value: 10},
    {name: '安仁县', value: 9},
    {name: '揭阳市', value: 9},
    {name: '海南州', value: 6},
    {name: '忻州市', value: 4},
    {name: '运城市', value: 3},
    {name: '金秀瑶族自治县', value: 2},
    {name: '焦作市', value: 1},
    {name: '兴山县', value: 1}
    ];

    var data31 = [
    {name: '杭州市', value: 312754}
    ];
    var data32 = [
    {name: '南京市', value: 85093},
    {name: '福州市', value: 76657},
    {name: '宁波市', value: 62580},
    {name: '泰州市', value: 57162},
    {name: '厦门市', value: 56747},
    {name: '广州市', value: 45410},
    {name: '深圳市', value: 35100}
    ];
    var data33 = [
    {name: '泉州市', value: 34056},
    {name: '台州市', value: 30020},
    {name: '汉中市', value: 29961},
    {name: '盐城市', value: 29470},
    {name: '赣州市', value: 27267},
    {name: '保定市', value: 25375},
    {name: '宿迁市', value: 23182},
    {name: '丽水市', value: 19229},
    {name: '三明市', value: 18398},
    {name: '宣城市', value: 14874},
    {name: '天津市', value: 14445},
    {name: '扬州市', value: 14010},
    {name: '龙岩市', value: 11309},
    {name: '衢州市', value: 10131},
    {name: '宁德市', value: 9998},
    {name: '淮安市', value: 9359},
    {name: '莆田市', value: 9179},
    {name: '上海市', value: 8618},
    {name: '济南市', value: 7608},
    {name: '绍兴市', value: 7049},
    {name: '舟山市', value: 7016},
    {name: '武汉市', value: 6855},
    {name: '遂宁市', value: 6318},
    {name: '临海市', value: 6164},
    {name: '周口市', value: 6102},
    {name: '衡水市', value: 6086},
    {name: '衡阳市', value: 6035},
    {name: '金华市', value: 5916},
    {name: '南宁市', value: 5465},
    {name: '蚌埠市', value: 5464},
    {name: '南阳市', value: 4769},
    {name: '桐乡市', value: 4595},
    {name: '海口市', value: 4449},
    {name: '襄阳市', value: 4435},
    {name: '宜昌市', value: 3860},
    {name: '沧州市', value: 3750},
    {name: '嘉兴市', value: 3655},
    {name: '益阳市', value: 2314},
    {name: '丽江市', value: 2028},
    {name: '常德市', value: 1906},
    {name: '重庆市', value: 1817},
    {name: '三亚市', value: 1546},
    {name: '荆州市', value: 1468},
    {name: '绵阳市', value: 1386},
    {name: '邢台市', value: 1263},
    {name: '邵阳市', value: 1247},
    {name: '淮北市', value: 790},
    {name: '柳州市', value: 789},
    {name: '宿州市', value: 789},
    {name: '黄山市', value: 744},
    {name: '巢湖市', value: 741},
    {name: '信阳市', value: 695},
    {name: '北海市', value: 649},
    {name: '秦皇岛市', value: 539},
    {name: '宜春市', value: 518},
    {name: '百色市', value: 505},
    {name: '延安市', value: 502},
    {name: '石家庄市', value: 435},
    {name: '儋州市', value: 404},
    {name: '许昌市', value: 403},
    {name: '来宾市', value: 386},
    {name: '五指山市', value: 355},
    {name: '东方市', value: 279},
    {name: '北京市', value: 265},
    {name: '永州市', value: 265},
    {name: '琼海市', value: 230},
    {name: '屯昌县', value: 170},
    {name: '呼和浩特市', value: 169},
    {name: '玉林市', value: 169},
    {name: '惠州市', value: 145},
    {name: '漳州市', value: 140},
    {name: '琼中县', value: 139},
    {name: '潍坊市', value: 131},
    {name: '乐东县', value: 116},
    {name: '保亭县', value: 107},
    {name: '临高县', value: 106},
    {name: '文昌市', value: 98},
    {name: '陇南市', value: 78},
    {name: '昌江县', value: 65},
    {name: '新乡市', value: 64},
    {name: '万宁市', value: 52},
    {name: '陵水县', value: 38},
    {name: '恩施州', value: 36},
    {name: '白沙县', value: 29},
    {name: '崇左市', value: 29},
    {name: '中卫市', value: 26},
    {name: '张家界市', value: 25},
    {name: '香港', value: 23},
    {name: '六盘水市', value: 19},
    {name: '茂名市', value: 18},
    {name: '张家口市', value: 18},
    {name: '澄迈县', value: 17},
    {name: '定安县', value: 17},
    {name: '焦作市', value: 17},
    {name: '铜川市', value: 12},
    {name: '淮南市', value: 7},
    {name: '乌海市', value: 6},
    {name: '庆阳市', value: 5},
    {name: '鄂尔多斯市', value: 1},
    {name: '金秀瑶族自治县', value: 1},
    {name: '运城市', value: 1}
    ];

    var data41 = [
    {name: '杭州市', value: 98094}
    ];
    var data42 = [
    {name: '广州市', value: 15274},
    {name: '深圳市', value: 14689},
    {name: '福州市', value: 14585},
    {name: '宁波市', value: 12859},
    {name: '泉州市', value: 10837},
    {name: '厦门市', value: 9964},
    {name: '赣州市', value: 9819}
    ];
    var data43 = [
    {name: '泰州市', value: 8898},
    {name: '济南市', value: 8060},
    {name: '宿迁市', value: 3349},
    {name: '莆田市', value: 2572},
    {name: '台州市', value: 2146},
    {name: '宣城市', value: 1864},
    {name: '衡水市', value: 1779},
    {name: '淮安市', value: 1559},
    {name: '丽水市', value: 1544},
    {name: '宁德市', value: 1457},
    {name: '临海市', value: 1426},
    {name: '汉中市', value: 1311},
    {name: '沧州市', value: 1166},
    {name: '南阳市', value: 1115},
    {name: '周口市', value: 828},
    {name: '三明市', value: 626},
    {name: '龙岩市', value: 604},
    {name: '邢台市', value: 204},
    {name: '荆州市', value: 201},
    {name: '北京市', value: 180},
    {name: '益阳市', value: 104},
    {name: '许昌市', value: 69},
    {name: '呼和浩特市', value: 30},
    {name: '扬州市', value: 28},
    {name: '衡阳市', value: 18},
    {name: '盐城市', value: 17},
    {name: '宿州市', value: 15},
    {name: '天津市', value: 15},
    {name: '延安市', value: 13},
    {name: '金华市', value: 11},
    {name: '焦作市', value: 8},
    {name: '襄阳市', value: 7},
    {name: '衢州市', value: 6},
    {name: '宜春市', value: 5},
    {name: '甘孜藏族自治州', value: 3},
    {name: '香港', value: 3},
    {name: '新乡市', value: 2},
    {name: '南召县', value: 1},
    {name: '乌海市', value: 1}
    ];

    var geoCoordMap = {
    '上海市':[121.47,31.23],
    '威海市':[122.12,37.52],
    '大庆市':[125.03,46.58],
    '泉州市':[118.67,24.88],
    '巢湖市':[117.87,31.6],
    '六安市':[116.5,31.77],
    '平凉市':[106.67,35.55],
    '定西市':[104.62,35.58],
    '玉林市':[110.17,22.63],
    '文昌市':[110.8,19.55],
    '东方市':[108.63,19.1],
    '定安县':[110.32,19.7],
    '贵阳市':[106.63,26.65],
    '秦皇岛市':[119.6,39.93],
    '佳木斯市':[130.37,46.82],
    '黄冈市':[114.87,30.45],
    '咸宁市':[114.32,29.85],
    '张家界市':[110.47,29.13],
    '淮安市':[119.02,33.62],
    '赣州市':[114.93,25.83],
    '鄂尔多斯市':[109.8,39.62],
    '巴彦淖尔市':[107.42,40.75],
    '忻州市':[112.73,38.42],
    '日照市':[119.52,35.42],
    '德州市':[116.3,37.45],
    '聊城市':[115.98,36.45],
    '曲靖市':[103.8,25.5],
    '保山市':[99.17,25.12],
    '嘉兴市':[120.75,30.75],
    '湖州市':[120.08,30.9],
    '衢州市':[118.87,28.93],
    '天津市':[117.2,39.12],
    '临海市':[121.12,28.85],
    '福州市':[119.3,26.08],
    '乌海市':[106.82,39.67],
    '淮南市':[117,32.63],
    '三明市':[117.62,26.27],
    '武威市':[102.63,37.93],
    '陇南市':[104.92,33.4],
    '桂林市':[110.28,25.28],
    '防城港市':[108.35,21.7],
    '儋州市':[109.57,19.52],
    '金秀瑶族自治县':[110.18,24.13],
    '崇左市':[107.37,22.4],
    '六盘水市':[104.83,26.6],
    '兴山县':[110.75,31.35],
    '安阳市':[114.38,36.1],
    '岳阳市':[113.12,29.37],
    '孝感市':[113.92,30.93],
    '荆州市':[112.23,30.33],
    '银川市':[106.28,38.47],
    '克什克腾旗':[117.53,43.25],
    '淄博市':[118.05,36.82],
    '中卫市':[105.18,37.52],
    '运城市':[110.98,35.02],
    '丽江市':[100.23,26.88],
    '烟台市':[121.43,37.45],
    '中山市':[113.38,22.52],
    '北海市':[109.12,21.48],
    '江门市':[113.08,22.58],
    '宁德市':[119.52,26.67],
    '惠州市':[114.42,23.12],
    '梅州市':[116.12,24.28],
    '张家口市':[114.88,40.82],
    '五指山市':[109.52,18.78],
    '临高县':[109.68,19.92],
    '来宾市':[109.23,23.73],
    '黄石市':[115.03,30.2],
    '南召县':[112.43,33.5],
    '信阳市':[114.07,32.13],
    '株洲市':[113.13,27.83],
    '苏州市':[120.58,31.3],
    '石嘴山市':[106.38,39.02],
    '吴忠市':[106.2,37.98],
    '呼和浩特市':[111.73,40.83],
    '巴林右旗':[118.67,43.52],
    '延安市':[109.48,36.6],
    '泰安市':[117.08,36.2],
    '晋中市':[112.75,37.68],
    '西宁市':[101.78,36.62],
    '朔州市':[112.43,39.33],
    '渭南市':[109.5,34.5],
    '绵阳市':[104.73,31.47],
    '遂宁市':[105.57,30.52],
    '杭州市':[120.15,30.28],
    '深圳市':[114.05,22.55],
    '香港':[114.08,22.2],
    '宿迁市':[118.28,33.97],
    '宣城市':[118.75,30.95],
    '龙岩市':[117.03,25.1],
    '邯郸市':[114.48,36.62],
    '琼海市':[110.47,19.25],
    '屯昌县':[110.1,19.37],
    '周口市':[114.65,33.62],
    '怀化市':[110,27.57],
    '盐城市':[120.15,33.35],
    '宜春市':[114.38,27.8],
    '杭锦后旗':[107.15,40.88],
    '临沂市':[118.35,35.05],
    '滨州市':[117.97,37.38],
    '商洛市':[109.93,33.87],
    '昆明市':[102.72,25.05],
    '台州市':[121.43,28.68],
    '舟山市':[122.2,30],
    '建德市':[119.28,29.48],
    '北京市':[116.4,39.9],
    '济南市':[116.98,36.67],
    '连云港市':[119.22,34.6],
    '邢台市':[114.48,37.07],
    '重庆市':[106.55,29.57],
    '黄山市':[118.33,29.72],
    '宿州市':[116.98,33.63],
    '云浮市':[112.03,22.92],
    '珠海市':[113.57,22.27],
    '保定市':[115.47,38.87],
    '海口市':[110.32,20.03],
    '武汉市':[114.3,30.6],
    '洛阳市':[112.45,34.62],
    '新乡市':[113.9,35.3],
    '衡阳市':[112.57,26.9],
    '武陵区':[111.68,29.03],
    '益阳市':[112.32,28.6],
    '安仁县':[113.27,26.7],
    '永州市':[111.62,26.43],
    '泰州市':[119.92,32.45],
    '临汾市':[111.52,36.08],
    '铜川市':[108.93,34.9],
    '岐山县':[107.62,34.45],
    '温州市':[120.7,28],
    '绍兴县':[120.47,30.08],
    '石家庄市':[114.52,38.05],
    '芜湖市':[118.38,31.33],
    '淮北市':[116.8,33.95],
    '天水市':[105.72,34.58],
    '阳江市':[111.98,21.87],
    '清远市':[113.03,23.7],
    '贺州市':[111.55,24.42],
    '湛江市':[110.35,21.27],
    '厦门市':[118.08,24.48],
    '澄迈县':[110,19.73],
    '漯河市':[114.02,33.58],
    '宜昌市':[111.28,30.7],
    '南阳市':[112.52,33],
    '驻马店市':[114.02,32.98],
    '长沙市':[112.93,28.23],
    '邵阳市':[111.47,27.25],
    '徐州市':[117.18,34.27],
    '固原市':[106.28,36],
    '丽水市':[119.92,28.45],
    '金华市':[119.65,29.08],
    '玉环县':[121.23,28.13],
    '广州市':[113.27,23.13],
    '衡水市':[115.68,37.73],
    '亳州市':[115.78,33.85],
    '漳州市':[117.65,24.52],
    '南平市':[118.17,26.65],
    '揭阳市':[116.37,23.55],
    '百色市':[106.62,23.9],
    '庆阳市':[107.63,35.73],
    '柳州市':[109.42,24.33],
    '汕头市':[116.68,23.35],
    '三亚市':[109.5,18.25],
    '许昌市':[113.85,34.03],
    '商丘市':[115.65,34.45],
    '开封市':[114.3,34.8],
    '鹤壁市':[114.28,35.75],
    '鹤岗市':[130.27,47.33],
    '随州市':[113.37,31.72],
    '湘潭市':[112.93,27.83],
    '洪江市':[109.82,27.2],
    '郴州市':[113.02,25.78],
    '南通市':[120.88,31.98],
    '赤峰市':[118.92,42.27],
    '西安市':[108.93,34.27],
    '咸阳市':[108.7,34.33],
    '阳泉市':[113.57,37.85],
    '汉中市':[107.02,33.07],
    '安康市':[109.02,32.68],
    '泸州市':[105.43,28.87],
    '甘孜藏族自治州':[101.97,30.05],
    '桐乡市':[120.57,30.63],
    '宁波市':[121.55,29.88],
    '沧州市':[116.83,38.3],
    '莆田市':[119,25.43],
    '蚌埠市':[117.38,32.92],
    '阜阳市':[115.82,32.9],
    '东莞市':[113.75,23.05],
    '云安县':[112,23.08],
    '文县':[104.68,32.95],
    '南宁市':[108.37,22.82],
    '韶关市':[113.6,24.82],
    '贵港市':[109.6,23.1],
    '佛山市':[113.12,23.02],
    '茂名市':[110.92,21.67],
    '肇庆市':[112.47,23.05],
    '万宁市':[110.4,18.8],
    '焦作市':[113.25,35.22],
    '濮阳市':[115.03,35.77],
    '南京市':[118.78,32.07],
    '娄底市':[112,27.73],
    '湘西土家族苗族自治州':[109.73,28.32],
    '常德市':[111.68,29.05],
    '扬州市':[119.4,32.4],
    '潍坊市':[119.15,36.7],
    '吕梁市':[111.13,37.52],
    '宝鸡市':[107.13,34.37],
    '昭通市':[103.72,27.33],
    '绍兴市':[120.57,30],

    '恩施州':[109.47,30.3],
    '保亭县':[109.7,18.64],
    '乐东县':[109.17,18.73],
    '昌江县':[109.03,19.25],
    '海南州':[100.62,36.28],
    '陵水县':[110.02,18.48],
    '襄阳市':[112.07,32.02],
    '琼中县':[109.83,19.05],
    '文山州':[104.24,23.37],
    '白沙县':[109.44,19.23],
    '海西州':[97.37,37.37]
    };

    var convertData = function (data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
            var geoCoord = geoCoordMap[data[i].name];
            if (geoCoord) {
                res.push({
                    name: data[i].name,
                    value: geoCoord.concat(data[i].value)
                });
            }
        }
        return res;
    };

    var series = [];
    [['2016', data11, data12, data13],
    ['2015', data21, data22, data23],
    ['2014', data31, data32, data33],
    ['2013', data41, data42, data43]].forEach(function (item, i) {
        series.push(
            {
                name: item[0] + '购票人数',
                type: 'scatter',
                coordinateSystem: 'geo',
                data: convertData(item[3]),
                symbolSize: 8,
                label: {
                    normal: {
                        formatter: '{b}',
                        position: 'right',
                        show: false
                    },
                    emphasis: {
                        show: true
                    }
                },
                itemStyle: {
                    normal: {
                        color: '#ff8000'
                    }
                }
            },
            {
                name: item[0] + '购票人数',
                type: 'effectScatter',
                coordinateSystem: 'geo',
                data: convertData(item[2]),
                symbolSize: 13,
                showEffectOn: 'render',
                rippleEffect: {
                    brushType: 'stroke'
                },
                hoverAnimation: true,
                label: {
                    normal: {
                        formatter: '{b}',
                        position: 'right',
                        show: true
                    }
                },
                itemStyle: {
                    normal: {
                        color: '#f4e925',
                        shadowBlur: 50000,
                        shadowColor: '#333'
                    }
                },
                zlevel: 1
            },
            {
                name: item[0] + '购票人数',
                type: 'effectScatter',
                coordinateSystem: 'geo',
                data: convertData(item[1]),
                symbolSize: 25 ,
                showEffectOn: 'render',
                rippleEffect: {
                    brushType: 'stroke'
                },
                hoverAnimation: true,
                label: {
                    normal: {
                        formatter: '{b}',
                        position: 'right',
                        show: true
                    }
                },
                itemStyle: {
                    normal: {
                        color: '#f4e925',
                        shadowBlur: 50000,
                        shadowColor: '#333'
                    }
                },
                zlevel: 2
            });
    });

    var option = {
        backgroundColor: '#404a59',
        title: {
            text: '',
            subtext: 'data from 畅途',
            sublink: 'http://www.changtu.com/',
            left: 'center',
            textStyle: {
                color: '#fff'
            }
        },
        tooltip : {
            trigger: 'item'
        },
        legend: {
            orient: 'vertical',
            y: 'bottom',
            x:'right',
            data:['2016购票人数', '2015购票人数', '2014购票人数', '2013购票人数'],
            textStyle: {
                color: '#fff'
            },
            selectedMode: 'single'
        },
        dataRange: {
            min: 0,
            max: 100000,
            calculable: true,
            color: ['#ff7500','#eac736','#50a3ba'],
            textStyle: {
                color: '#fff'
            }
        },
        geo: {
            map: 'china',
            label: {
                emphasis: {
                    show: false
                }
            },
            roam: true,
            zoom: 1.8,
            itemStyle: {
                normal: {
                    areaColor: '#323c48',
                    borderColor: '#111'
                },
                emphasis: {
                    areaColor: '#2a333d'
                }
            }
        },
        series : series,
    };

    myChart.setOption(option);
}


function lineMap2(myChart) {

    var geoCoordMap = {
    '上海市':[121.47,31.23],
    '威海市':[122.12,37.52],
    '大庆市':[125.03,46.58],
    '泉州市':[118.67,24.88],
    '巢湖市':[117.87,31.6],
    '六安市':[116.5,31.77],
    '平凉市':[106.67,35.55],
    '定西市':[104.62,35.58],
    '玉林市':[110.17,22.63],
    '文昌市':[110.8,19.55],
    '东方市':[108.63,19.1],
    '定安县':[110.32,19.7],
    '贵阳市':[106.63,26.65],
    '秦皇岛市':[119.6,39.93],
    '佳木斯市':[130.37,46.82],
    '黄冈市':[114.87,30.45],
    '咸宁市':[114.32,29.85],
    '张家界市':[110.47,29.13],
    '淮安市':[119.02,33.62],
    '赣州市':[114.93,25.83],
    '鄂尔多斯市':[109.8,39.62],
    '巴彦淖尔市':[107.42,40.75],
    '忻州市':[112.73,38.42],
    '日照市':[119.52,35.42],
    '德州市':[116.3,37.45],
    '聊城市':[115.98,36.45],
    '曲靖市':[103.8,25.5],
    '保山市':[99.17,25.12],
    '嘉兴市':[120.75,30.75],
    '湖州市':[120.08,30.9],
    '衢州市':[118.87,28.93],
    '天津市':[117.2,39.12],
    '临海市':[121.12,28.85],
    '福州市':[119.3,26.08],
    '乌海市':[106.82,39.67],
    '淮南市':[117,32.63],
    '三明市':[117.62,26.27],
    '武威市':[102.63,37.93],
    '陇南市':[104.92,33.4],
    '桂林市':[110.28,25.28],
    '防城港市':[108.35,21.7],
    '儋州市':[109.57,19.52],
    '金秀瑶族自治县':[110.18,24.13],
    '崇左市':[107.37,22.4],
    '六盘水市':[104.83,26.6],
    '兴山县':[110.75,31.35],
    '安阳市':[114.38,36.1],
    '岳阳市':[113.12,29.37],
    '孝感市':[113.92,30.93],
    '荆州市':[112.23,30.33],
    '银川市':[106.28,38.47],
    '克什克腾旗':[117.53,43.25],
    '淄博市':[118.05,36.82],
    '中卫市':[105.18,37.52],
    '运城市':[110.98,35.02],
    '丽江市':[100.23,26.88],
    '烟台市':[121.43,37.45],
    '中山市':[113.38,22.52],
    '北海市':[109.12,21.48],
    '江门市':[113.08,22.58],
    '宁德市':[119.52,26.67],
    '惠州市':[114.42,23.12],
    '梅州市':[116.12,24.28],
    '张家口市':[114.88,40.82],
    '五指山市':[109.52,18.78],
    '临高县':[109.68,19.92],
    '来宾市':[109.23,23.73],
    '黄石市':[115.03,30.2],
    '南召县':[112.43,33.5],
    '信阳市':[114.07,32.13],
    '株洲市':[113.13,27.83],
    '苏州市':[120.58,31.3],
    '石嘴山市':[106.38,39.02],
    '吴忠市':[106.2,37.98],
    '呼和浩特市':[111.73,40.83],
    '巴林右旗':[118.67,43.52],
    '延安市':[109.48,36.6],
    '泰安市':[117.08,36.2],
    '晋中市':[112.75,37.68],
    '西宁市':[101.78,36.62],
    '朔州市':[112.43,39.33],
    '渭南市':[109.5,34.5],
    '绵阳市':[104.73,31.47],
    '遂宁市':[105.57,30.52],
    '杭州市':[120.15,30.28],
    '深圳市':[114.05,22.55],
    '香港':[114.08,22.2],
    '宿迁市':[118.28,33.97],
    '宣城市':[118.75,30.95],
    '龙岩市':[117.03,25.1],
    '邯郸市':[114.48,36.62],
    '琼海市':[110.47,19.25],
    '屯昌县':[110.1,19.37],
    '周口市':[114.65,33.62],
    '怀化市':[110,27.57],
    '盐城市':[120.15,33.35],
    '宜春市':[114.38,27.8],
    '杭锦后旗':[107.15,40.88],
    '临沂市':[118.35,35.05],
    '滨州市':[117.97,37.38],
    '商洛市':[109.93,33.87],
    '昆明市':[102.72,25.05],
    '台州市':[121.43,28.68],
    '舟山市':[122.2,30],
    '建德市':[119.28,29.48],
    '北京市':[116.4,39.9],
    '济南市':[116.98,36.67],
    '连云港市':[119.22,34.6],
    '邢台市':[114.48,37.07],
    '重庆市':[106.55,29.57],
    '黄山市':[118.33,29.72],
    '宿州市':[116.98,33.63],
    '云浮市':[112.03,22.92],
    '珠海市':[113.57,22.27],
    '保定市':[115.47,38.87],
    '海口市':[110.32,20.03],
    '武汉市':[114.3,30.6],
    '洛阳市':[112.45,34.62],
    '新乡市':[113.9,35.3],
    '衡阳市':[112.57,26.9],
    '武陵区':[111.68,29.03],
    '益阳市':[112.32,28.6],
    '安仁县':[113.27,26.7],
    '永州市':[111.62,26.43],
    '泰州市':[119.92,32.45],
    '临汾市':[111.52,36.08],
    '铜川市':[108.93,34.9],
    '岐山县':[107.62,34.45],
    '温州市':[120.7,28],
    '绍兴县':[120.47,30.08],
    '石家庄市':[114.52,38.05],
    '芜湖市':[118.38,31.33],
    '淮北市':[116.8,33.95],
    '天水市':[105.72,34.58],
    '阳江市':[111.98,21.87],
    '清远市':[113.03,23.7],
    '贺州市':[111.55,24.42],
    '湛江市':[110.35,21.27],
    '厦门市':[118.08,24.48],
    '澄迈县':[110,19.73],
    '漯河市':[114.02,33.58],
    '宜昌市':[111.28,30.7],
    '南阳市':[112.52,33],
    '驻马店市':[114.02,32.98],
    '长沙市':[112.93,28.23],
    '邵阳市':[111.47,27.25],
    '徐州市':[117.18,34.27],
    '固原市':[106.28,36],
    '丽水市':[119.92,28.45],
    '金华市':[119.65,29.08],
    '玉环县':[121.23,28.13],
    '广州市':[113.27,23.13],
    '衡水市':[115.68,37.73],
    '亳州市':[115.78,33.85],
    '漳州市':[117.65,24.52],
    '南平市':[118.17,26.65],
    '揭阳市':[116.37,23.55],
    '百色市':[106.62,23.9],
    '庆阳市':[107.63,35.73],
    '柳州市':[109.42,24.33],
    '汕头市':[116.68,23.35],
    '三亚市':[109.5,18.25],
    '许昌市':[113.85,34.03],
    '商丘市':[115.65,34.45],
    '开封市':[114.3,34.8],
    '鹤壁市':[114.28,35.75],
    '鹤岗市':[130.27,47.33],
    '随州市':[113.37,31.72],
    '湘潭市':[112.93,27.83],
    '洪江市':[109.82,27.2],
    '郴州市':[113.02,25.78],
    '南通市':[120.88,31.98],
    '赤峰市':[118.92,42.27],
    '西安市':[108.93,34.27],
    '咸阳市':[108.7,34.33],
    '阳泉市':[113.57,37.85],
    '汉中市':[107.02,33.07],
    '安康市':[109.02,32.68],
    '泸州市':[105.43,28.87],
    '甘孜藏族自治州':[101.97,30.05],
    '桐乡市':[120.57,30.63],
    '宁波市':[121.55,29.88],
    '沧州市':[116.83,38.3],
    '莆田市':[119,25.43],
    '蚌埠市':[117.38,32.92],
    '阜阳市':[115.82,32.9],
    '东莞市':[113.75,23.05],
    '云安县':[112,23.08],
    '文县':[104.68,32.95],
    '南宁市':[108.37,22.82],
    '韶关市':[113.6,24.82],
    '贵港市':[109.6,23.1],
    '佛山市':[113.12,23.02],
    '茂名市':[110.92,21.67],
    '肇庆市':[112.47,23.05],
    '万宁市':[110.4,18.8],
    '焦作市':[113.25,35.22],
    '濮阳市':[115.03,35.77],
    '南京市':[118.78,32.07],
    '娄底市':[112,27.73],
    '湘西土家族苗族自治州':[109.73,28.32],
    '常德市':[111.68,29.05],
    '扬州市':[119.4,32.4],
    '潍坊市':[119.15,36.7],
    '吕梁市':[111.13,37.52],
    '宝鸡市':[107.13,34.37],
    '昭通市':[103.72,27.33],
    '绍兴市':[120.57,30],


    '河源市':[114.7,23.73],
    '河池市':[108.07,24.7],
    '钦州市':[108.62,21.95],
    '十堰市':[110.78,32.65],
    '黔南布依族苗族自治州':[107.52,26.27],
    '伊春市':[128.9,47.73],
    '成都市':[104.07,30.67],
    '无锡市':[120.3,31.57],
    '常州市':[119.95,31.78],
    '镇江市':[119.45,32.2],


    '恩施州':[109.47,30.3],
    '保亭县':[109.7,18.64],
    '乐东县':[109.17,18.73],
    '昌江县':[109.03,19.25],
    '海南州':[100.62,36.28],
    '陵水县':[110.02,18.48],
    '襄阳市':[112.07,32.02],
    '琼中县':[109.83,19.05],
    '文山州':[104.24,23.37],
    '白沙县':[109.44,19.23],
    '海西州':[97.37,37.37]
    };

    var nanjing = [
    [{name:'南京市'},{name:'淮安市',value:38390}],
    [{name:'南京市'},{name:'宿迁市',value:24983}],
    [{name:'南京市'},{name:'南通市',value:22775}],
    [{name:'南京市'},{name:'徐州市',value:22566}],
    [{name:'南京市'},{name:'盐城市',value:22435}],
    [{name:'南京市'},{name:'泰州市',value:17503}],
    [{name:'南京市'},{name:'扬州市',value:17245}],
    [{name:'南京市'},{name:'连云港市',value:13939}],
    [{name:'南京市'},{name:'宣城市',value:5188}],
    [{name:'南京市'},{name:'苏州市',value:4784}]
    ];

    var guangzhou = [
    [{name:'广州市'},{name:'茂名市',value:8784}],
    [{name:'广州市'},{name:'湛江市',value:6908}],
    [{name:'广州市'},{name:'清远市',value:6268}],
    [{name:'广州市'},{name:'肇庆市',value:5846}],
    [{name:'广州市'},{name:'云浮市',value:5546}],
    [{name:'广州市'},{name:'阳江市',value:4960}],
    [{name:'广州市'},{name:'梅州市',value:4324}],
    [{name:'广州市'},{name:'河源市',value:4176}],
    [{name:'广州市'},{name:'江门市',value:3898}],
    [{name:'广州市'},{name:'玉林市',value:3850}]
    ];

    var hangzhou = [
    [{name:'杭州市'},{name:'杭州市',value:21306}],
    [{name:'杭州市'},{name:'绍兴市',value:7664}],
    [{name:'杭州市'},{name:'金华市',value:6436}],
    [{name:'杭州市'},{name:'台州市',value:5911}],
    [{name:'杭州市'},{name:'嘉兴市',value:4799}],
    [{name:'杭州市'},{name:'宁波市',value:4713}],
    [{name:'杭州市'},{name:'湖州市',value:4681}],
    [{name:'杭州市'},{name:'衢州市',value:4155}],
    [{name:'杭州市'},{name:'丽水市',value:3762}],
    [{name:'杭州市'},{name:'黄山市',value:2922}]
    ];

    var hanzhong = [
    [{name:'汉中市'},{name:'西安市',value:21988}],
    [{name:'汉中市'},{name:'汉中市',value:12543}],
    [{name:'汉中市'},{name:'安康市',value:2615}],
    [{name:'汉中市'},{name:'宝鸡市',value:1281}],
    [{name:'汉中市'},{name:'渭南市',value:800}],
    [{name:'汉中市'},{name:'苏州市',value:792}],
    [{name:'汉中市'},{name:'广州市',value:748}],
    [{name:'汉中市'},{name:'咸阳市',value:591}],
    [{name:'汉中市'},{name:'深圳市',value:552}],
    [{name:'汉中市'},{name:'成都市',value:520}]
    ];

    var nanning = [
    [{name:'南宁市'},{name:'玉林市',value:8382}],
    [{name:'南宁市'},{name:'南宁市',value:5649}],
    [{name:'南宁市'},{name:'崇左市',value:4585}],
    [{name:'南宁市'},{name:'河池市',value:4278}],
    [{name:'南宁市'},{name:'百色市',value:2988}],
    [{name:'南宁市'},{name:'来宾市',value:2135}],
    [{name:'南宁市'},{name:'钦州市',value:1753}],
    [{name:'南宁市'},{name:'桂林市',value:1632}],
    [{name:'南宁市'},{name:'贵港市',value:1287}],
    [{name:'南宁市'},{name:'广州市',value:998}]
    ];



    var xiamen = [
    [{name:'厦门市'},{name:'泉州市',value:8307}],
    [{name:'厦门市'},{name:'三明市',value:6851}],
    [{name:'厦门市'},{name:'龙岩市',value:6279}],
    [{name:'厦门市'},{name:'漳州市',value:3971}],
    [{name:'厦门市'},{name:'莆田市',value:1540}],
    [{name:'厦门市'},{name:'赣州市',value:1313}],
    [{name:'厦门市'},{name:'南平市',value:1186}],
    [{name:'厦门市'},{name:'福州市',value:508}],
    [{name:'厦门市'},{name:'宁德市',value:391}],
    [{name:'厦门市'},{name:'汕头市',value:309}]
    ];

    var xian = [
    [{name:'西安市'},{name:'汉中市',value:6276}],
    [{name:'西安市'},{name:'安康市',value:4904}],
    [{name:'西安市'},{name:'宝鸡市',value:4525}],
    [{name:'西安市'},{name:'庆阳市',value:2639}],
    [{name:'西安市'},{name:'平凉市',value:2244}],
    [{name:'西安市'},{name:'商洛市',value:1802}],
    [{name:'西安市'},{name:'苏州市',value:1698}],
    [{name:'西安市'},{name:'上海市',value:910}],
    [{name:'西安市'},{name:'渭南市',value:846}],
    [{name:'西安市'},{name:'十堰市',value:647}]
    ];





    var convertData = function (data) {
        var res = [];
        for (var i = 0; i < data.length; i++) {
            var dataItem = data[i];
            var fromCoord = geoCoordMap[dataItem[0].name];
            var toCoord = geoCoordMap[dataItem[1].name];
            if (fromCoord && toCoord) {
                res.push([{
                    name: dataItem[0].name,
                    coord: fromCoord
                }, {
                    name: dataItem[1].name,
                    coord: toCoord
                }]);
            }
        }
        return res;
    };

    var color = ['#a6c84c', '#ffa022', '#46bee9', '#ff5151','#cbf3fb',
    '#e0e0e0', '#00ffff', '#f9f900', '#fdd283','#be77ff'];
    var series = [];
    [['南京市', nanjing], ['广州市', guangzhou], ['杭州市', hangzhou],
    ['汉中市', hanzhong], ['南宁市', nanning],
    ['厦门市', xiamen], ['西安市', xian]
    ].forEach(function (item, i) {
        series.push({
            name: item[0] + ' Top10',
            type: 'lines',
            zlevel: 1,
            effect: {
                show: true,
                period: 6,
                trailLength: 0.7,
                color: '#fff',
                symbolSize: 3
            },
            lineStyle: {
                normal: {
                    color: color[i],
                    width: 0,
                    curveness: 0.2
                }
            },
            data: convertData(item[1])
        },
        {
            name: item[0] + ' Top10',
            type: 'lines',
            zlevel: 2,
            effect: {
                show: true,
                period: 6,
                trailLength: 0,
                symbol: 'triangle',
                symbolSize: 15
            },
            lineStyle: {
                normal: {
                    color: color[i],
                    width: 1,
                    opacity: 0.4,
                    curveness: 0.2
                }
            },
            data: convertData(item[1])
        },
        {
            name: item[0] + ' Top10',
            type: 'effectScatter',
            coordinateSystem: 'geo',
            zlevel: 2,
            rippleEffect: {
                brushType: 'stroke'
            },
            label: {
                normal: {
                    show: true,
                    position: 'right',
                    formatter: '{b}'
                }
            },

            // symbolSize: function (val) {
            //     return val[2] / 300;
            // },
            itemStyle: {
                normal: {
                    color: color[i]
                }
            },
            data: item[1].map(function (dataItem) {
                return {
                    name: dataItem[1].name,
                    value: geoCoordMap[dataItem[1].name].concat([dataItem[1].value])
                };
            })
        });
    });

    var option = {
        backgroundColor: '#404a59',
        title : {
            text: '主要路线分布',
            subtext: 'data from 畅途',
            sublink: 'http://www.changtu.com/',
            left: 'center',
            textStyle: {
                color: '#fff'
            }
        },
        tooltip : {
            trigger: 'item'
        },
        legend: {
            orient: 'vertical',
            top: 'bottom',
            left: 'right',
            selectedMode: 'single',
            data:['南京市 Top10', '广州市 Top10', '杭州市 Top10',
            '汉中市 Top10', '南宁市 Top10',
            '厦门市 Top10', '西安市 Top10'],
            textStyle: {
                color: '#fff'
            }
        },
        geo: {
            map: 'china',
            zoom: 1.5,
            label: {
                emphasis: {
                    show: false
                }
            },
            roam: true,
            itemStyle: {
                normal: {
                    areaColor: '#323c48',
                    borderColor: '#404a59'
                },
                emphasis: {
                    areaColor: '#2a333d'
                }
            }
        },
        series: series
    };


    myChart.setOption(option);
}